[Killed] BooleanLiteral
main/components/Laptops/LaptopTable.js:8:74
 import { useNavigate } from "react-router-dom";
 import { hasRole } from "main/utils/currentUser";
 
-export default function LaptopsTable({ laptops, currentUser, showButtons=true }) {
+export default function LaptopsTable({ laptops, currentUser, showButtons=false }) {
 	const navigate = useNavigate();
 
killedBy: LaptopsIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="LaptopTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/components/Laptops/LaptopTable.js:11:33
 export default function LaptopsTable({ laptops, currentUser, showButtons=true }) {
 	const navigate = useNavigate();
 
-	const editCallback = (cell) => {
-		navigate(`/laptops/edit/${cell.row.values.id}`)
-	}
+	const editCallback = (cell) => {}
 
 	const detailsCallback = (cell) => {
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/laptops/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/Laptops/LaptopTable.js:15:36
 		navigate(`/laptops/edit/${cell.row.values.id}`)
 	}
 
-	const detailsCallback = (cell) => {
-		navigate(`/laptops/details/${cell.row.values.id}`)
-	}
+	const detailsCallback = (cell) => {}
 
 	// Stryker disable all : hard to test for query caching
killedBy: UserTable tests Details button navigates to the details page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/laptops/details/2"

Number of calls: 0

<html>
  <head />
