[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:83:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Schools" id="appnavbar-schools-dropdown" data-testid="appnavbar-schools-dropdown" >
-                    <NavDropdown.Item href="/schools/list" data-testid="appnavbar-schools-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/schools/create" data-testid="appnavbar-schools-create">Create</NavDropdown.Item>
-                        )
-                    }
-                  </NavDropdown>
-                )
+                true
               }
             </Nav>
killedBy: AppNavbar tests renders the school menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-schools-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:83:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Schools" id="appnavbar-schools-dropdown" data-testid="appnavbar-schools-dropdown" >
-                    <NavDropdown.Item href="/schools/list" data-testid="appnavbar-schools-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/schools/create" data-testid="appnavbar-schools-create">Create</NavDropdown.Item>
-                        )
-                    }
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_USER") || <NavDropdown title="Schools" id="appnavbar-schools-dropdown" data-testid="appnavbar-schools-dropdown">
+                    <NavDropdown.Item href="/schools/list" data-testid="appnavbar-schools-list">List</NavDropdown.Item>
+                    {hasRole(currentUser, "ROLE_ADMIN") && <NavDropdown.Item href="/schools/create" data-testid="appnavbar-schools-create">Create</NavDropdown.Item>}
+                  </NavDropdown>
               }
             </Nav>
killedBy: AppNavbar tests renders the school menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-schools-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:87:23
                   <NavDropdown title="Schools" id="appnavbar-schools-dropdown" data-testid="appnavbar-schools-dropdown" >
                     <NavDropdown.Item href="/schools/list" data-testid="appnavbar-schools-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/schools/create" data-testid="appnavbar-schools-create">Create</NavDropdown.Item>
-                        )
+                      true
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the schools menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-schools-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:87:23
                   <NavDropdown title="Schools" id="appnavbar-schools-dropdown" data-testid="appnavbar-schools-dropdown" >
                     <NavDropdown.Item href="/schools/list" data-testid="appnavbar-schools-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/schools/create" data-testid="appnavbar-schools-create">Create</NavDropdown.Item>
-                        )
+                      false
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the schools menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-schools-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:99:15
                   
             <Nav className="mr-auto">
             {
-              hasRole(currentUser, "ROLE_USER") && (
-                <NavDropdown title="Laptops" id="appnavbar-laptops-dropdown" data-testid="appnavbar-laptops-dropdown" >
-                    <NavDropdown.Item href="/laptops/list" data-testid="appnavbar-laptops-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/laptops/create" data-testid="appnavbar-laptops-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                )
+              hasRole(currentUser, "ROLE_USER") || <NavDropdown title="Laptops" id="appnavbar-laptops-dropdown" data-testid="appnavbar-laptops-dropdown">
+                    <NavDropdown.Item href="/laptops/list" data-testid="appnavbar-laptops-list">List</NavDropdown.Item>
+                    {hasRole(currentUser, "ROLE_ADMIN") && <NavDropdown.Item href="/laptops/create" data-testid="appnavbar-laptops-create">Create</NavDropdown.Item>}
+                  </NavDropdown>
               }
             </Nav>
killedBy: AppNavbar tests renders the laptops menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-laptops-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:99:15
                   
             <Nav className="mr-auto">
             {
-              hasRole(currentUser, "ROLE_USER") && (
-                <NavDropdown title="Laptops" id="appnavbar-laptops-dropdown" data-testid="appnavbar-laptops-dropdown" >
-                    <NavDropdown.Item href="/laptops/list" data-testid="appnavbar-laptops-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/laptops/create" data-testid="appnavbar-laptops-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                )
+              false
               }
             </Nav>
killedBy: AppNavbar tests renders the laptops menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-laptops-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:103:23
                 <NavDropdown title="Laptops" id="appnavbar-laptops-dropdown" data-testid="appnavbar-laptops-dropdown" >
                     <NavDropdown.Item href="/laptops/list" data-testid="appnavbar-laptops-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/laptops/create" data-testid="appnavbar-laptops-create">Create</NavDropdown.Item>
-                      )
+                      true
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the laptops menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-laptops-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:103:23
                 <NavDropdown title="Laptops" id="appnavbar-laptops-dropdown" data-testid="appnavbar-laptops-dropdown" >
                     <NavDropdown.Item href="/laptops/list" data-testid="appnavbar-laptops-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/laptops/create" data-testid="appnavbar-laptops-create">Create</NavDropdown.Item>
-                      )
+                      hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown.Item href="/laptops/create" data-testid="appnavbar-laptops-create">Create</NavDropdown.Item>
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the laptops menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-laptops-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >
