[Killed] ArrowFunction
main/pages/Laptops/LaptopCreatePage.js:9:31
 
 export default function LaptopsCreatePage() {
 
-  const objectToAxiosParams = (laptop) => ({
-    url: "/api/laptops/post",
-    method: "POST",
-    params: {
-      name: laptop.name,
-      cpu: laptop.cpu,
-      gpu: laptop.gpu,
-      description: laptop.description
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (laptop) => {
killedBy: LaptopsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Laptops/LaptopCreatePage.js:10:10
 export default function LaptopsCreatePage() {
 
   const objectToAxiosParams = (laptop) => ({
-    url: "/api/laptops/post",
+    url: "",
     method: "POST",
     params: {
killedBy: LaptopsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New laptop Created - id: 17 name: OMEN 16t-k000"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/Laptops/LaptopCreatePage.js:11:13
 
   const objectToAxiosParams = (laptop) => ({
     url: "/api/laptops/post",
-    method: "POST",
+    method: "",
     params: {
       name: laptop.name,
killedBy: LaptopsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Laptops/LaptopCreatePage.js:20:33
     }
   });
 
-  const onSuccess = (laptop) => {
-    toast(`New laptop Created - id: ${laptop.id} name: ${laptop.name}`);
-  }
+  const onSuccess = (laptop) => {}
 
   const mutation = useBackendMutation(
killedBy: LaptopsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New laptop Created - id: 17 name: OMEN 16t-k000"

Number of calls: 0

[Killed] BlockStatement
main/pages/Laptops/LaptopCreatePage.js:37:18
     mutation.mutate(data);
   }
 
-  if (isSuccess) {
-    return <Navigate to="/laptops/list" />
-  }
+  if (isSuccess) {}
 
 
killedBy: LaptopsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/laptops/list"}

Number of calls: 0
