[Killed] StringLiteral
main/pages/Laptops/LaptopDetailsPage.js:17:22
             [`/api/laptops?id=${id}`],
             {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
                 method: "GET",
-                url: `/api/laptops`,
+                url: ``,
                 params: {
                     id
killedBy: LaptopDetailsPage tests renders without crashing
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/laptops"
Received string:    "Error communicating with backend via GET on "

[Killed] ConditionalExpression
main/pages/Laptops/LaptopDetailsPage.js:28:28
 		<BasicLayout>
 			<div className="pt-2">
 				<h1>Laptop Details</h1>
-				<LaptopTable laptops={[laptop || {}]} currentUser={currentUser} showButtons={false} />
+				<LaptopTable laptops={[true]} currentUser={currentUser} showButtons={false} />
 			</div>
 		</BasicLayout>
killedBy: LaptopDetailsPage tests loads the correct fields, and no buttons
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:

[Killed] ConditionalExpression
main/pages/Laptops/LaptopDetailsPage.js:28:28
 		<BasicLayout>
 			<div className="pt-2">
 				<h1>Laptop Details</h1>
-				<LaptopTable laptops={[laptop || {}]} currentUser={currentUser} showButtons={false} />
+				<LaptopTable laptops={[false]} currentUser={currentUser} showButtons={false} />
 			</div>
 		</BasicLayout>
killedBy: LaptopDetailsPage tests loads the correct fields, and no buttons
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:
