[Killed] ArrowFunction
main/pages/Laptops/LaptopEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (laptop) => ({
-        url: "/api/laptops",
-        method: "PUT",
-        params: {
-            id: laptop.id,
-        },
-        data: {
-            name: laptop.name,
-            cpu: laptop.cpu,
-            gpu: laptop.gpu,
-            description: laptop.description
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (laptop) => {
killedBy: LaptopsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Laptop Updated - id: 17 name: ASUS E210"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/Laptops/LaptopEditPage.js:25:14
         );
 
     const objectToAxiosPutParams = (laptop) => ({
-        url: "/api/laptops",
+        url: "",
         method: "PUT",
         params: {
killedBy: LaptopsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Laptop Updated - id: 17 name: ASUS E210"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/Laptops/LaptopEditPage.js:38:35
         }
     });
 
-    const onSuccess = (laptop) => {
-        toast(`Laptop Updated - id: ${laptop.id} name: ${laptop.name}`);
-    }
+    const onSuccess = (laptop) => {}
 
     const mutation = useBackendMutation(
killedBy: LaptopsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Laptop Updated - id: 17 name: ASUS E210"

Number of calls: 0

[Killed] ConditionalExpression
main/pages/Laptops/LaptopEditPage.js:63:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Laptop</h1>
-                {laptop &&
-                    <LaptopForm initialLaptop={laptop} submitAction={onSubmit} buttonLabel="Update" />
+                {true
                 }
             </div>
killedBy: LaptopsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="LaptopForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/Laptops/LaptopEditPage.js:63:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Laptop</h1>
-                {laptop &&
-                    <LaptopForm initialLaptop={laptop} submitAction={onSubmit} buttonLabel="Update" />
+                {laptop || <LaptopForm initialLaptop={laptop} submitAction={onSubmit} buttonLabel="Update" />
                 }
             </div>
killedBy: LaptopsEditPage tests when the backend doesn't return a todo renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="LaptopForm-name" id="name" name="name" type="text" /> instead
