[Killed] BlockStatement
main/pages/Laptops/LaptopIndexPage.js:8:44
 import LaptopsTable from 'main/components/Laptops/LaptopTable';
 import { useCurrentUser } from 'main/utils/currentUser'
 
-export default function LaptopsIndexPage() {
-
-	const currentUser = useCurrentUser();
-
-	const { data: laptops, error: _error, status: _status } =
-		useBackend(
-			// Stryker disable next-line all : don't test internal caching of React Query
-			["/api/laptops/all"],
-			{ method: "GET", url: "/api/laptops/all" },
-			[]
-		);
-
-
-	return (
-		<BasicLayout>
-			<div className="pt-2">
-				<h1>Laptops</h1>
-				<LaptopsTable laptops={laptops} currentUser={currentUser} />
-			</div>
-		</BasicLayout>
-	)
-}
+export default function LaptopsIndexPage() {}
killedBy: LaptopsIndexPage tests renders without crashing for regular user
statusReason: Error: LaptopsIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/pages/Laptops/LaptopIndexPage.js:16:26
 		useBackend(
 			// Stryker disable next-line all : don't test internal caching of React Query
 			["/api/laptops/all"],
-			{ method: "GET", url: "/api/laptops/all" },
+			{ method: "GET", url: "" },
 			[]
 		);
killedBy: LaptopsIndexPage tests renders three laptops without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="LaptopTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/pages/Laptops/LaptopIndexPage.js:16:4
 		useBackend(
 			// Stryker disable next-line all : don't test internal caching of React Query
 			["/api/laptops/all"],
-			{ method: "GET", url: "/api/laptops/all" },
+			{},
 			[]
 		);
killedBy: LaptopsIndexPage tests renders three laptops without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="LaptopTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
