[Killed] ArrayDeclaration
main/components/Schools/SchoolTable.js:32:21
         navigate(`/schools/details/${cell.row.values.id}`)
     }
 
-    const columns = [
-        {
-            Header: 'id',
-            accessor: 'id', // accessor is the "key" in the data
-        },
-
-        {
-            Header: 'Name',
-            accessor: 'name',
-        },
-        {
-            Header: 'Rank',
-            accessor: 'rank',
-        },
-        {
-            Header: 'Description',
-            accessor: 'description',
-        }
-    ];
+    const columns = [];
 
     const buttonColumns = [
killedBy: SchoolTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Schools/SchoolTable.js:44:23
         },
         {
             Header: 'Rank',
-            accessor: 'rank',
+            accessor: "",
         },
         {
killedBy: SchoolTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchoolTable-cell-row-0-col-rank"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
