[Killed] BlockStatement
main/pages/Schools/SchoolCreatePage.js:6:44
 import { useNavigate } from 'react-router-dom'
 import { schoolUtils } from 'main/utils/schoolUtils';
 
-export default function SchoolCreatePage() {
-
-  let navigate = useNavigate(); 
-
-  const onSubmit = async (school) => {
-    const createdSchool = schoolUtils.add(school);
-    console.log("createdSchool: " + JSON.stringify(createdSchool));
-    navigate("/schools/list");;
-  }  
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create New School</h1>
-        <SchoolForm submitAction={onSubmit} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function SchoolCreatePage() {}
 
killedBy: SchoolCreatePage tests renders without crashing
statusReason: Error: SchoolCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Schools/SchoolCreatePage.js:10:38
 
   let navigate = useNavigate(); 
 
-  const onSubmit = async (school) => {
-    const createdSchool = schoolUtils.add(school);
-    console.log("createdSchool: " + JSON.stringify(createdSchool));
-    navigate("/schools/list");;
-  }  
+  const onSubmit = async (school) => {}  
 
   return (
killedBy: SchoolCreatePage tests redirects to /schools on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
