[Killed] BlockStatement
main/pages/Schools/SchoolIndexPage.js:17:44
 
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
-    const deleteCallback = async (cell) => {
-        console.log(`SchoolIndexPage deleteCallback: ${showCell(cell)})`);
-        schoolUtils.del(cell.row.values.id);
-        navigate("/schools/list");
-    }
+    const deleteCallback = async (cell) => {}
 
     return (
killedBy: SchoolIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
main/pages/Schools/SchoolIndexPage.js:20:18
     const deleteCallback = async (cell) => {
         console.log(`SchoolIndexPage deleteCallback: ${showCell(cell)})`);
         schoolUtils.del(cell.row.values.id);
-        navigate("/schools/list");
+        navigate("");
     }
 
killedBy: SchoolIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/schools/list"
Received: ""

Number of calls: 1

<html>
