[Killed] BlockStatement
src/main/utils/laptopUtils.js:9:47
 	toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-	return {
-		url: "/api/laptops",
-		method: "DELETE",
-		params: {
-			id: cell.row.values.id
-		}
-	}
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 
killedBy: LaptopsIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Laptop with id 2 was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
src/main/utils/laptopUtils.js:12:11
 export function cellToAxiosParamsDelete(cell) {
 	return {
 		url: "/api/laptops",
-		method: "DELETE",
+		method: "",
 		params: {
 			id: cell.row.values.id
killedBy: LaptopsIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Laptop with id 2 was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
