[Killed] StringLiteral
main/components/Laptops/LaptopForm.js:6:68
 import { useForm } from 'react-hook-form'
 import { useNavigate } from 'react-router-dom';
 
-function LaptopForm({ initialContents, submitAction, buttonLabel = "Create" }) {
+function LaptopForm({ initialContents, submitAction, buttonLabel = "" }) {
 
     const navigate = useNavigate();
killedBy: LaptopCreatePage tests redirects to /laptops on submit
statusReason: TestingLibraryElementError: Unable to find an element with the text: Create. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
