[Killed] BlockStatement
main/components/Laptops/LaptopTable.js:9:47
 const showCell = (cell) => JSON.stringify(cell.row.values);
 
 
-const defaultDeleteCallback = async (cell) => {
-	console.log(`deleteCallback: ${showCell(cell)})`);
-	laptopUtils.del(cell.row.values.id);
-}
+const defaultDeleteCallback = async (cell) => {}
 
 export default function LaptopTable({
killedBy: LaptopTable tests Delete button calls delete callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/components/Laptops/LaptopTable.js:22:33
 
 	const navigate = useNavigate();
 
-	const editCallback = (cell) => {
-		console.log(`editCallback: ${showCell(cell)})`);
-		navigate(`/laptops/edit/${cell.row.values.id}`)
-	}
+	const editCallback = (cell) => {}
 
 	const detailsCallback = (cell) => {
killedBy: LaptopTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/laptops/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/Laptops/LaptopTable.js:27:36
 		navigate(`/laptops/edit/${cell.row.values.id}`)
 	}
 
-	const detailsCallback = (cell) => {
-		console.log(`detailsCallback: ${showCell(cell)})`);
-		navigate(`/laptops/details/${cell.row.values.id}`)
-	}
+	const detailsCallback = (cell) => {}
 
 	const columns = [
killedBy: LaptopTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/laptops/details/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Laptops/LaptopTable.js:29:12
 
 	const detailsCallback = (cell) => {
 		console.log(`detailsCallback: ${showCell(cell)})`);
-		navigate(`/laptops/details/${cell.row.values.id}`)
+		navigate(``)
 	}
 
killedBy: LaptopTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/laptops/details/2"
Received: ""

Number of calls: 1

<html>

[Killed] ObjectLiteral
main/components/Laptops/LaptopTable.js:42:3
 			Header: 'Name',
 			accessor: 'name',
 		},
-		{
-			Header: 'CPU',
-			accessor: 'cpu',
-		},
+		{},
 		{
 			Header: 'GPU',
killedBy: LaptopTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Laptops/LaptopTable.js:43:12
 			accessor: 'name',
 		},
 		{
-			Header: 'CPU',
+			Header: "",
 			accessor: 'cpu',
 		},
killedBy: LaptopTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: CPU. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Laptops/LaptopTable.js:44:14
 		},
 		{
 			Header: 'CPU',
-			accessor: 'cpu',
+			accessor: "",
 		},
 		{
killedBy: LaptopTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="LaptopTable-cell-row-0-col-cpu"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Laptops/LaptopTable.js:47:12
 			accessor: 'cpu',
 		},
 		{
-			Header: 'GPU',
+			Header: "",
 			accessor: 'gpu',
 		},
killedBy: LaptopTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: GPU. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Laptops/LaptopTable.js:48:14
 		},
 		{
 			Header: 'GPU',
-			accessor: 'gpu',
+			accessor: "",
 		},
 		{
killedBy: LaptopTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="LaptopTable-cell-row-0-col-gpu"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
