[Killed] BlockStatement
main/pages/Laptops/LaptopDetailsPage.js:6:45
 import LaptopTable from "main/components/Laptops/LaptopTable";
 import { laptopUtils } from "main/utils/laptopUtils";
 
-export default function LaptopDetailsPage() {
-	let { id } = useParams();
-
-	const response = laptopUtils.getById(id);
-
-	return (
-		<BasicLayout>
-			<div className="pt-2">
-				<h1>Laptop Details</h1>
-				<LaptopTable laptops={[response.laptop]} showButtons={false} />
-			</div>
-		</BasicLayout>
-	)
-}
+export default function LaptopDetailsPage() {}
 
killedBy: LaptopDetailsPage tests renders without crashing
statusReason: Error: LaptopDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BooleanLiteral
main/pages/Laptops/LaptopDetailsPage.js:15:59
 		<BasicLayout>
 			<div className="pt-2">
 				<h1>Laptop Details</h1>
-				<LaptopTable laptops={[response.laptop]} showButtons={false} />
+				<LaptopTable laptops={[response.laptop]} showButtons={true} />
 			</div>
 		</BasicLayout>
killedBy: LaptopDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

<th
  colspan="1"
  data-testid="LaptopTable-header-Delete"
  role="columnheader"
