[Killed] BlockStatement
main/pages/Laptops/LaptopEditPage.js:9:42
 import { useNavigate } from 'react-router-dom'
 
 
-export default function LaptopEditPage() {
-    let { id } = useParams();
-
-    let navigate = useNavigate(); 
-
-    const response = laptopUtils.getById(id);
-
-    const onSubmit = async (laptop) => {
-        const updatedLaptop = laptopUtils.update(laptop);
-        console.log("updatedLaptop: " + JSON.stringify(updatedLaptop));
-        navigate("/laptops");
-    }  
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Edit Laptop</h1>
-                <LaptopForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.laptop}/>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function LaptopEditPage() {}
killedBy: LaptopEditPage tests renders without crashing
statusReason: Error: LaptopEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Laptops/LaptopEditPage.js:16:40
 
     const response = laptopUtils.getById(id);
 
-    const onSubmit = async (laptop) => {
-        const updatedLaptop = laptopUtils.update(laptop);
-        console.log("updatedLaptop: " + JSON.stringify(updatedLaptop));
-        navigate("/laptops");
-    }  
+    const onSubmit = async (laptop) => {}  
 
     return (
killedBy: LaptopEditPage tests redirects to /laptops on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Laptops/LaptopEditPage.js:18:21
 
     const onSubmit = async (laptop) => {
         const updatedLaptop = laptopUtils.update(laptop);
-        console.log("updatedLaptop: " + JSON.stringify(updatedLaptop));
+        console.log("" + JSON.stringify(updatedLaptop));
         navigate("/laptops");
     }  
killedBy: LaptopEditPage tests redirects to /laptops on submit
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "updatedLaptop: {\"laptop\":{\"id\":2,\"name\":\"Alienware m18\",\"cpu\":\"Intel Core i7-13650HX\",\"gpu\":\"NVIDIA GeForce RTX 4050 Laptop\",\"description\":\"Extremely fast but expensive\"}}"
Received string:    "{\"laptop\":{\"id\":2,\"name\":\"Alienware m18\",\"cpu\":\"Intel Core i7-13650HX\",\"gpu\":\"NVIDIA GeForce RTX 4050 Lapto

[Killed] StringLiteral
main/pages/Laptops/LaptopEditPage.js:19:18
     const onSubmit = async (laptop) => {
         const updatedLaptop = laptopUtils.update(laptop);
         console.log("updatedLaptop: " + JSON.stringify(updatedLaptop));
-        navigate("/laptops");
+        navigate("");
     }  
 
killedBy: LaptopEditPage tests redirects to /laptops on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/laptops"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/pages/Laptops/LaptopEditPage.js:26:66
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Laptop</h1>
-                <LaptopForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.laptop}/>
+                <LaptopForm submitAction={onSubmit} buttonLabel={""} initialContents={response.laptop}/>
             </div>
         </BasicLayout>
killedBy: LaptopEditPage tests redirects to /laptops on submit
statusReason: TestingLibraryElementError: Unable to find an element with the text: Update. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
