[Killed] BlockStatement
main/pages/Laptops/LaptopIndexPage.js:17:41
 
 	const showCell = (cell) => JSON.stringify(cell.row.values);
 
-	const deleteCallback = async (cell) => {
-		console.log(`LaptopIndexPage deleteCallback: ${showCell(cell)})`);
-		laptopUtils.del(cell.row.values.id);
-		navigate("/laptops");
-	}
+	const deleteCallback = async (cell) => {}
 
 	return (
killedBy: LaptopIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
main/pages/Laptops/LaptopIndexPage.js:26:29
 	return (
 		<BasicLayout>
 			<div className="pt-2">
-				<Button style={{ float: "right" }} as={Link} to="/laptops/create">
+				<Button style={{ float: "" }} as={Link} to="/laptops/create">
 					Create Laptop
 				</Button>
killedBy: LaptopIndexPage tests renders correct fields
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
