[Killed] BlockStatement
src/main/utils/laptopUtils.js:2:19
 // get laptops from local storage
-const get = () => {
-	const laptopValue = localStorage.getItem("laptops");
-	if (laptopValue === undefined) {
-		const laptopCollection = { nextId: 1, laptops: [] }
-		return set(laptopCollection);
-	}
-	const laptopCollection = JSON.parse(laptopValue);
-	if (laptopCollection === null) {
-		const laptopCollection = { nextId: 1, laptops: [] }
-		return set(laptopCollection);
-	}
-	return laptopCollection;
-};
+const get = () => {};
 
 const getById = (id) => {
killedBy: LaptopTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of undefined (reading 'laptops')

[Killed] ConditionalExpression
src/main/utils/laptopUtils.js:4:6
 // get laptops from local storage
 const get = () => {
 	const laptopValue = localStorage.getItem("laptops");
-	if (laptopValue === undefined) {
+	if (true) {
 		const laptopCollection = { nextId: 1, laptops: [] }
 		return set(laptopCollection);
killedBy: laptopUtils tests get When laptops is [] in local storage, should return []
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "laptops", "{\"nextId\":1,\"laptops\":[]}"

[Killed] BlockStatement
src/main/utils/laptopUtils.js:4:33
 // get laptops from local storage
 const get = () => {
 	const laptopValue = localStorage.getItem("laptops");
-	if (laptopValue === undefined) {
-		const laptopCollection = { nextId: 1, laptops: [] }
-		return set(laptopCollection);
-	}
+	if (laptopValue === undefined) {}
 	const laptopCollection = JSON.parse(laptopValue);
 	if (laptopCollection === null) {
killedBy: laptopUtils tests get When laptops is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] BlockStatement
src/main/utils/laptopUtils.js:9:33
 		return set(laptopCollection);
 	}
 	const laptopCollection = JSON.parse(laptopValue);
-	if (laptopCollection === null) {
-		const laptopCollection = { nextId: 1, laptops: [] }
-		return set(laptopCollection);
-	}
+	if (laptopCollection === null) {}
 	return laptopCollection;
 };
killedBy: LaptopTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of null (reading 'laptops')

[Killed] ConditionalExpression
src/main/utils/laptopUtils.js:9:6
 		return set(laptopCollection);
 	}
 	const laptopCollection = JSON.parse(laptopValue);
-	if (laptopCollection === null) {
+	if (true) {
 		const laptopCollection = { nextId: 1, laptops: [] }
 		return set(laptopCollection);
killedBy: laptopUtils tests get When laptops is [] in local storage, should return []
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "laptops", "{\"nextId\":1,\"laptops\":[]}"

[Killed] BlockStatement
src/main/utils/laptopUtils.js:16:25
 	return laptopCollection;
 };
 
-const getById = (id) => {
-	if (id === undefined) {
-		return { "error": "id is a required parameter" };
-	}
-	const laptopCollection = get();
-	const laptops = laptopCollection.laptops;
-
-	/* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-	const index = laptops.findIndex((r) => r.id == id);
-	if (index === -1) {
-		return { "error": `laptop with id ${id} not found` };
-	}
-	return { laptop: laptops[index] };
-}
+const getById = (id) => {}
 
 // set laptops in local storage
killedBy: laptopUtils tests getById Check that getting a laptop by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"laptop": {"cpu": "Intel Core i7-13650HX", "description": "Extremely fast but expensive", "gpu": "NVIDIA GeForce RTX 4050 Laptop", "id": 3, "name": "Alienware m18"}}
Received: undefined

[Killed] ConditionalExpression
src/main/utils/laptopUtils.js:24:41
 	const laptops = laptopCollection.laptops;
 
 	/* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-	const index = laptops.findIndex((r) => r.id == id);
+	const index = laptops.findIndex((r) => true);
 	if (index === -1) {
 		return { "error": `laptop with id ${id} not found` };
killedBy: laptopUtils tests getById Check that getting a laptop by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Object {
    "laptop": Object {
-     "cpu": "Intel Core i7-13650HX",

[Killed] ArrowFunction
src/main/utils/laptopUtils.js:24:34
 	const laptops = laptopCollection.laptops;
 
 	/* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-	const index = laptops.findIndex((r) => r.id == id);
+	const index = laptops.findIndex(() => undefined);
 	if (index === -1) {
 		return { "error": `laptop with id ${id} not found` };
killedBy: laptopUtils tests getById Check that getting a laptop by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

  Object {
-   "laptop": Object {
-     "cpu": "Intel Core i7-13650HX",

[Killed] UnaryOperator
src/main/utils/laptopUtils.js:25:16
 
 	/* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
 	const index = laptops.findIndex((r) => r.id == id);
-	if (index === -1) {
+	if (index === +1) {
 		return { "error": `laptop with id ${id} not found` };
 	}
killedBy: laptopUtils tests getById Check that getting a laptop by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

  Object {
-   "laptop": Object {
-     "cpu": "Intel Core i7-13650HX",

[Killed] ConditionalExpression
src/main/utils/laptopUtils.js:25:6
 
 	/* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
 	const index = laptops.findIndex((r) => r.id == id);
-	if (index === -1) {
+	if (true) {
 		return { "error": `laptop with id ${id} not found` };
 	}
killedBy: laptopUtils tests getById Check that getting a laptop by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

  Object {
-   "laptop": Object {
-     "cpu": "Intel Core i7-13650HX",

[Killed] BlockStatement
src/main/utils/laptopUtils.js:32:35
 }
 
 // set laptops in local storage
-const set = (laptopCollection) => {
-	localStorage.setItem("laptops", JSON.stringify(laptopCollection));
-	return laptopCollection;
-};
+const set = (laptopCollection) => {};
 
 // add a laptop to local storage
killedBy: laptopUtils tests get When laptops is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"laptops": [], "nextId": 1}
Received: undefined

[Killed] BlockStatement
src/main/utils/laptopUtils.js:38:25
 };
 
 // add a laptop to local storage
-const add = (laptop) => {
-	const laptopCollection = get();
-	laptop = { ...laptop, id: laptopCollection.nextId };
-	laptopCollection.nextId++;
-	laptopCollection.laptops.push(laptop);
-	set(laptopCollection);
-	return laptop;
-};
+const add = (laptop) => {};
 
 // update a laptop in local storage
killedBy: laptopUtils tests add Starting from [], check that adding one laptop works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"cpu": "Intel Core i5-12500H", "description": "Cheap but still fast", "gpu": "NVIDIA GeForce RTX 3050 Laptop", "id": 1, "name": "OMEN 16t-k000"}
Received: undefined

[Killed] UpdateOperator
src/main/utils/laptopUtils.js:41:2
 const add = (laptop) => {
 	const laptopCollection = get();
 	laptop = { ...laptop, id: laptopCollection.nextId };
-	laptopCollection.nextId++;
+	laptopCollection.nextId--;
 	laptopCollection.laptops.push(laptop);
 	set(laptopCollection);
killedBy: laptopUtils tests add Starting from [], check that adding one laptop works
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "laptops", "{\"nextId\":2,\"laptops\":[{\"id\":1,\"name\":\"OMEN 16t-k000\",\"cpu\":\"Intel Core i5-12500H\",\"gpu\":\"NVIDIA GeForce RTX 3050 Laptop\",\"description\":\"Cheap but still fast\"}]}"
Received: "laptops", "{\"nextId\":0,\"laptops\":[{\"id\":1,\"name\":\"OMEN 16t-k000\",\"cpu\":\"Intel Core i5-12500H\",\"gpu\":\"NVID

[Killed] BlockStatement
src/main/utils/laptopUtils.js:48:28
 };
 
 // update a laptop in local storage
-const update = (laptop) => {
-	const laptopCollection = get();
-
-	const laptops = laptopCollection.laptops;
-
-	/* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-	const index = laptops.findIndex((r) => r.id == laptop.id);
-	if (index === -1) {
-		return { "error": `laptop with id ${laptop.id} not found` };
-	}
-	laptops[index] = laptop;
-	set(laptopCollection);
-	return { laptopCollection: laptopCollection };
-};
+const update = (laptop) => {};
 
 // delete a restaurant from local storage
killedBy: laptopUtils tests update Check that updating an existing restaurant works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ConditionalExpression
src/main/utils/laptopUtils.js:54:41
 	const laptops = laptopCollection.laptops;
 
 	/* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-	const index = laptops.findIndex((r) => r.id == laptop.id);
+	const index = laptops.findIndex((r) => true);
 	if (index === -1) {
 		return { "error": `laptop with id ${laptop.id} not found` };
killedBy: laptopUtils tests update Check that updating an non-existing laptop returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 24

  Object {
-   "error": "laptop with id 99 not found",
+   "laptopCollection": Object {

[Killed] ArrowFunction
src/main/utils/laptopUtils.js:54:34
 	const laptops = laptopCollection.laptops;
 
 	/* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-	const index = laptops.findIndex((r) => r.id == laptop.id);
+	const index = laptops.findIndex(() => undefined);
 	if (index === -1) {
 		return { "error": `laptop with id ${laptop.id} not found` };
killedBy: laptopUtils tests update Check that updating an existing restaurant works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 26
+ Received  +  1

  Object {
-   "laptopCollection": Object {
-     "laptops": Array [

[Killed] ConditionalExpression
src/main/utils/laptopUtils.js:55:6
 
 	/* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
 	const index = laptops.findIndex((r) => r.id == laptop.id);
-	if (index === -1) {
+	if (false) {
 		return { "error": `laptop with id ${laptop.id} not found` };
 	}
killedBy: laptopUtils tests update Check that updating an non-existing laptop returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 26

  Object {
-   "error": "laptop with id 99 not found",
+   "laptopCollection": Object {

[Killed] EqualityOperator
src/main/utils/laptopUtils.js:55:6
 
 	/* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
 	const index = laptops.findIndex((r) => r.id == laptop.id);
-	if (index === -1) {
+	if (index !== -1) {
 		return { "error": `laptop with id ${laptop.id} not found` };
 	}
killedBy: laptopUtils tests update Check that updating an existing restaurant works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 26
+ Received  +  1

  Object {
-   "laptopCollection": Object {
-     "laptops": Array [

[Killed] BlockStatement
src/main/utils/laptopUtils.js:64:21
 };
 
 // delete a restaurant from local storage
-const del = (id) => {
-	if (id === undefined) {
-		return { "error": "id is a required parameter" };
-	}
-	const laptopCollection = get();
-	const laptops = laptopCollection.laptops;
-
-	/* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-	const index = laptops.findIndex((r) => r.id == id);
-	if (index === -1) {
-		return { "error": `laptop with id ${id} not found` };
-	}
-	laptops.splice(index, 1);
-	set(laptopCollection);
-	return { laptopCollection: laptopCollection };
-};
+const del = (id) => {};
 
 const laptopUtils = {
killedBy: laptopUtils tests del Check that deleting a laptop by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] EqualityOperator
src/main/utils/laptopUtils.js:72:41
 	const laptops = laptopCollection.laptops;
 
 	/* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-	const index = laptops.findIndex((r) => r.id == id);
+	const index = laptops.findIndex((r) => r.id != id);
 	if (index === -1) {
 		return { "error": `laptop with id ${id} not found` };
killedBy: laptopUtils tests del Check that deleting a laptop by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

@@ -1,14 +1,14 @@
  Object {
    "laptopCollection": Object {

[Killed] ConditionalExpression
src/main/utils/laptopUtils.js:72:41
 	const laptops = laptopCollection.laptops;
 
 	/* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-	const index = laptops.findIndex((r) => r.id == id);
+	const index = laptops.findIndex((r) => false);
 	if (index === -1) {
 		return { "error": `laptop with id ${id} not found` };
killedBy: laptopUtils tests del Check that deleting a laptop by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 19
+ Received  +  1

  Object {
-   "laptopCollection": Object {
-     "laptops": Array [

[Killed] ConditionalExpression
src/main/utils/laptopUtils.js:73:6
 
 	/* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
 	const index = laptops.findIndex((r) => r.id == id);
-	if (index === -1) {
+	if (false) {
 		return { "error": `laptop with id ${id} not found` };
 	}
killedBy: laptopUtils tests del Check that deleting a non-existing laptop returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 19

  Object {
-   "error": "laptop with id 99 not found",
+   "laptopCollection": Object {

[Killed] EqualityOperator
src/main/utils/laptopUtils.js:73:6
 
 	/* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
 	const index = laptops.findIndex((r) => r.id == id);
-	if (index === -1) {
+	if (index !== -1) {
 		return { "error": `laptop with id ${id} not found` };
 	}
killedBy: laptopUtils tests del Check that deleting a laptop by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 19
+ Received  +  1

  Object {
-   "laptopCollection": Object {
-     "laptops": Array [

[Killed] StringLiteral
src/main/utils/laptopUtils.js:74:21
 	/* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
 	const index = laptops.findIndex((r) => r.id == id);
 	if (index === -1) {
-		return { "error": `laptop with id ${id} not found` };
+		return { "error": `` };
 	}
 	laptops.splice(index, 1);
killedBy: laptopUtils tests del Check that deleting a non-existing laptop returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "laptop with id 99 not found",
+   "error": "",

[Killed] ObjectLiteral
src/main/utils/laptopUtils.js:81:21
 	return { laptopCollection: laptopCollection };
 };
 
-const laptopUtils = {
-	get,
-	getById,
-	add,
-	update,
-	del
-};
+const laptopUtils = {};
 
 export { laptopUtils };
killedBy: laptopUtils tests get When laptops is undefined in local storage, should set to empty list
statusReason: TypeError: _laptopUtils.laptopUtils.get is not a function
