[Killed] BlockStatement
main/pages/Laptops/LaptopCreatePage.js:6:44
 import { useNavigate } from 'react-router-dom'
 import { laptopUtils } from 'main/utils/laptopUtils';
 
-export default function LaptopCreatePage() {
-
-  let navigate = useNavigate(); 
-
-  const onSubmit = async (laptop) => {
-    const createdLaptop = laptopUtils.add(laptop);
-    console.log("createdLaptop: " + JSON.stringify(createdLaptop));
-    navigate("/laptops/list");
-  }  
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create New Laptop</h1>
-        <LaptopForm submitAction={onSubmit} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function LaptopCreatePage() {}
 
killedBy: LaptopCreatePage tests renders without crashing
statusReason: Error: LaptopCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Laptops/LaptopCreatePage.js:10:38
 
   let navigate = useNavigate(); 
 
-  const onSubmit = async (laptop) => {
-    const createdLaptop = laptopUtils.add(laptop);
-    console.log("createdLaptop: " + JSON.stringify(createdLaptop));
-    navigate("/laptops/list");
-  }  
+  const onSubmit = async (laptop) => {}  
 
   return (
killedBy: LaptopCreatePage tests redirects to /laptops on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Laptops/LaptopCreatePage.js:13:14
   const onSubmit = async (laptop) => {
     const createdLaptop = laptopUtils.add(laptop);
     console.log("createdLaptop: " + JSON.stringify(createdLaptop));
-    navigate("/laptops/list");
+    navigate("");
   }  
 
killedBy: LaptopCreatePage tests redirects to /laptops on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/laptops/list"
Received: ""

Number of calls: 1

<html>
