[Killed] BlockStatement
main/pages/Laptops/LaptopEditPage.js:9:42
 import { useNavigate } from 'react-router-dom'
 
 
-export default function LaptopEditPage() {
-    let { id } = useParams();
-
-    let navigate = useNavigate(); 
-
-    const response = laptopUtils.getById(id);
-
-    const onSubmit = async (laptop) => {
-        const updatedLaptop = laptopUtils.update(laptop);
-        console.log("updatedLaptop: " + JSON.stringify(updatedLaptop));
-        navigate("/laptops/list");
-    }  
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Edit Laptop</h1>
-                <LaptopForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.laptop}/>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function LaptopEditPage() {}
killedBy: LaptopEditPage tests renders without crashing
statusReason: Error: LaptopEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Laptops/LaptopEditPage.js:16:40
 
     const response = laptopUtils.getById(id);
 
-    const onSubmit = async (laptop) => {
-        const updatedLaptop = laptopUtils.update(laptop);
-        console.log("updatedLaptop: " + JSON.stringify(updatedLaptop));
-        navigate("/laptops/list");
-    }  
+    const onSubmit = async (laptop) => {}  
 
     return (
killedBy: LaptopEditPage tests redirects to /laptops on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Laptops/LaptopEditPage.js:19:18
     const onSubmit = async (laptop) => {
         const updatedLaptop = laptopUtils.update(laptop);
         console.log("updatedLaptop: " + JSON.stringify(updatedLaptop));
-        navigate("/laptops/list");
+        navigate("");
     }  
 
killedBy: LaptopEditPage tests redirects to /laptops on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/laptops/list"
Received: ""

Number of calls: 1

<html>
