[Killed] BlockStatement
main/pages/Laptops/LaptopIndexPage.js:17:41
 
 	const showCell = (cell) => JSON.stringify(cell.row.values);
 
-	const deleteCallback = async (cell) => {
-		console.log(`LaptopIndexPage deleteCallback: ${showCell(cell)})`);
-		laptopUtils.del(cell.row.values.id);
-		navigate("/laptops/list");
-	}
+	const deleteCallback = async (cell) => {}
 
 	return (
killedBy: LaptopIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
