[Killed] BlockStatement
main/pages/Schools/SchoolCreatePage.js:9:44
 import { systemInfoFixtures } from "fixtures/systemInfoFixtures";
 import axios from "axios";
 import AxiosMockAdapter from "axios-mock-adapter";
-export default function SchoolCreatePage() {
-
-  let navigate = useNavigate(); 
-
-  const onSubmit = async (school) => {
-    const createdSchool = schoolUtils.add(school);
-    console.log("createdSchool: " + JSON.stringify(createdSchool));
-    navigate("/schools");
-  }  
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create New School</h1>
-        <SchoolForm submitAction={onSubmit} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function SchoolCreatePage() {}
 
killedBy: SchoolCreatePage tests renders without crashing
statusReason: Error: SchoolCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/pages/Schools/SchoolCreatePage.js:16:14
   const onSubmit = async (school) => {
     const createdSchool = schoolUtils.add(school);
     console.log("createdSchool: " + JSON.stringify(createdSchool));
-    navigate("/schools");
+    navigate("");
   }  
 
killedBy: SchoolCreatePage tests redirects to /schools on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/schools"
Received: ""

Number of calls: 1

<html>
