[Killed] BlockStatement
main/pages/Schools/SchoolDetailsPage.js:9:45
 import { systemInfoFixtures } from "fixtures/systemInfoFixtures";
 import axios from "axios";
 import AxiosMockAdapter from "axios-mock-adapter";
-export default function SchoolDetailsPage() {
-  let { id } = useParams();
-
-  const response = schoolUtils.getById(id);
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>School Details</h1>
-        <SchoolTable schools={[response.school]} showButtons={false} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function SchoolDetailsPage() {}
 
killedBy: SchoolDetailsPage tests renders without crashing
statusReason: Error: SchoolDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
