[Killed] StringLiteral
main/pages/Schools/SchoolEditPage.js:22:18
     const onSubmit = async (school) => {
         const updatedSchool = schoolUtils.update(school);
         console.log("updatedSchool: " + JSON.stringify(updatedSchool));
-        navigate("/schools");
+        navigate("");
     }  
 
killedBy: SchoolEditPage tests redirects to /schools on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/schools"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/pages/Schools/SchoolEditPage.js:29:66
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit School</h1>
-                <SchoolForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.school}/>
+                <SchoolForm submitAction={onSubmit} buttonLabel={""} initialContents={response.school}/>
             </div>
         </BasicLayout>
killedBy: SchoolEditPage tests redirects to /schools on submit
statusReason: TestingLibraryElementError: Unable to find an element with the text: Update. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
